# Make connection to database and return all table names

In [ ]:
import sqlite3

In [ ]:
def sql_query(cmd):
    conn = sqlite3.connect('./Data/Northwind_small.sqlite')
    c = conn.cursor()
    c.execute(cmd)
    data = c.fetchall()
    conn.commit()
    c.close()
    return data

In [ ]:
sql_query("select name from sqlite_master where type='table'")

In [ ]:
sql_query("select * from pragma_table_info('pragma_table_info')")

# Return column names

In [ ]:
sql_query("select name from pragma_table_info('employee')")

# Return specific column(s) data

In [ ]:
sql_query("select lastname, firstname from employee")

# Return unique/distinct values and count

In [ ]:
sql_query("select distinct firstname from employee")

In [ ]:
sql_query("select count(distinct firstname) from employee")

In [ ]:
sql_query("select count(*) as distinctnames from (select distinct firstname from employee)")

# Filter result using WHERE conditions

In [ ]:
sql_query("select * from employee where city!='Seattle'")

In [ ]:
sql_query("select * from employee where reportsto>=5")

In [ ]:
# check for null
sql_query("select count(*) from employee where reportsto is null")

In [ ]:
# using not
sql_query("select count(*) from employee where not reportsto is null")

#### Operators in where clause

=	Equal
>	Greater than	
<	Less than	
>=	Greater than or equal	
<=	Less than or equal	
!=	Not equal. Note: In some versions of SQL this operator may be written as <>
BETWEEN	Between a certain range	
LIKE	Search for a pattern	
IN	To specify multiple possible values for a column

# Conditions with AND, OR, and NOT

In [ ]:
sql_query("select * from employee where (not reportsto is null) and ((city='Seattle') or (city='London')) ")

# Sort results with ORDER BY

In [ ]:
# SELECT * FROM <table>
# ORDER BY <field1>, <field2> DESC;

In [ ]:
sql_query("select * from employee where (not reportsto is null) and ((city='Seattle') or (city='London')) order by city, lastname")

# Add data with INSERT INTO

In [ ]:
sql_query("select name from sqlite_master where type='table'")

In [ ]:
sql_query("select * from pragma_table_info('region')")

In [ ]:
sql_query("insert into Region (RegionDescription) values ('Moon')")

In [ ]:
sql_query("insert into region (Id, RegionDescription) values(5, 'Moon')")

In [ ]:
sql_query("select * from region")

# Update records with UPDATE

In [ ]:
sql_query("update region set regiondescription='Mars' where id=5")

In [ ]:
sql_query("select * from region")

# Delete records

In [ ]:
sql_query("delete from region where id=7")

In [ ]:
sql_query("select * from region")

# LIMIT

In [ ]:
sql_query("select * from region limit 3")

# Functions

min(<field>)
max(<field>)
count(<field>)
avg(<field>)
sum(<field>)

In [ ]:
sql_query("select count(id) from region")

# LIKE

In [ ]:
# The percent sign (%) represents zero, one, or multiple characters
# The underscore sign (_) represents one, single character

#                 LIKE Operator	 Description
# WHERE CustomerName LIKE 'a%'	Finds any values that start with "a"
# WHERE CustomerName LIKE '%a'	Finds any values that end with "a"
# WHERE CustomerName LIKE '%or%'	Finds any values that have "or" in any position
# WHERE CustomerName LIKE '_r%'	Finds any values that have "r" in the second position
# WHERE CustomerName LIKE 'a_%'	Finds any values that start with "a" and are at least 2 characters in length
# WHERE CustomerName LIKE 'a__%'	Finds any values that start with "a" and are at least 3 characters in length
# WHERE ContactName LIKE 'a%o'	Finds any values that start with "a" and ends with "o"

In [ ]:
sql_query("select * from employee where lastname like 'k%'")

# Wild cards

In [ ]:
# NOTE: Only % and _ wild cards are used in sqlite

# Symbol	Description	Example
# %	Represents zero or more characters	bl% finds bl, black, blue, and blob
# _	Represents a single character	h_t finds hot, hat, and hit

In [ ]:
sql_query("select * from employee where lastname like '%ing'")

# IN operator

The IN operator is a shorthand for multiple OR conditions.

In [ ]:
sql_query("select firstname from employee where lastname in ('King', 'Suyama')")

# BETWEEN operator

In [ ]:
sql_query("select firstname from employee where id between 1 and 4")

In [ ]:
sql_query("select hiredate from employee where hiredate between '2025-01-01' and '2026-01-01'")

# Alias

In [ ]:
# sqlite does not support CONCAT() function. Instead, it uses || to concatinate strings

In [ ]:
sql_query("select lastname || ', ' || firstname from employee")

In [ ]:
sql_query("select (lastname || ', ' || firstname) as name from employee")

In [ ]:
sql_query("select x.lastname from employee as x")

# JOIN

In [ ]:
# NOTE: right and full outer join are not supported by sqlite3

# Different types of the JOINs in SQL:

# (INNER) JOIN: Returns records that have matching values in both tables
# LEFT (OUTER) JOIN: Returns all records from the left table, and the matched records from the right table

In [ ]:
sql_query("select name from sqlite_master where type='table'")

In [ ]:
sql_query("select name from pragma_table_info('employee')")

In [ ]:
sql_query("select name from pragma_table_info('product')")

In [ ]:
sql_query("select name from pragma_table_info('order')")

In [ ]:
sql_query("select name from pragma_table_info('customer')")

In [ ]:
sql_query("select product.id, product.productname, customer.companyname from ('order', product, orderdetail, customer) where (product.id = orderdetail.productid and orderdetail.orderid = 'order'.id and 'order'.customerid = customer.id) and product.id=5")

In [ ]:
sql_query("select 'order'.id, product.id, product.productname from ('order', product, orderdetail) WHERE ('order'.id = orderdetail.orderid) AND (orderdetail.productid = product.id)")

In [ ]:
# self join
sql_query("select employee.id from employee where employee.reportsto in (select employee.id from employee where employee.reportsto=2)")

In [ ]:
sql_query("select id, reportsto from employee")

In [ ]:
# inner join
sql_query("select supplier.id, supplier.companyname, product.productname, product.supplierid from (supplier, product) where supplier.id=product.supplierid")

In [ ]:
# inner join
sql_query("select supplier.id, supplier.companyname, product.productname, product.supplierid from supplier inner join product on supplier.id=product.supplierid")

In [ ]:
# left join
sql_query("select supplier.id, supplier.companyname, product.productname, product.supplierid from supplier left join product on supplier.id=product.supplierid")

# UNION

In [ ]:
sql_query("select 'customer', companyname, region from customer union select 'supplier', companyname, region from supplier")

# GROUP BY

In [ ]:
# The GROUP BY statement is often used with aggregate functions 
# (COUNT(), MAX(), MIN(), SUM(), AVG()) to group the result-set by one or more columns.

In [ ]:
sql_query("select count(companyname), region from customer group by region")

# HAVING

In [ ]:
sql_query("select count(id), region from customer where region='North America'")

In [ ]:
sql_query("select customer.companyname, count('order'.shipregion) from (customer, 'order') where customer.id='order'.customerid group by 'order'.shipregion having count('order'.shipregion) > 100")

# EXISTS

In [ ]:
sql_query("select supplier.companyname from (product, supplier) where product.supplierid=supplier.id and unitprice <10 order by supplier.companyname")

In [ ]:
sql_query("select supplier.companyname from supplier where exists (select productname from (product) where product.supplierid=supplier.id and unitprice <10 ) order by supplier.companyname")

# ANY, ALL

In [ ]:
# NOTE: sqlite does not support ANY and ALL operations instead
# rewrite ANY using IN 
# rewrite ALL using MAX() and MIN()

# The SQL SELECT INTO Statement

In [ ]:
# NOTE: sqlite does not support SELECT INTO operations instead
# use INSERT INTO
# create table and use AS

In [ ]:
sql_query("create table if not exists backup as select * from employee where reportsto>3.")
sql_query("insert into backup select * from employee where reportsto<3")
sql_query("select reportsto from backup")

# CASE

In [ ]:
#     CASE
#     WHEN condition1 THEN result1
#     WHEN condition2 THEN result2
#     WHEN conditionN THEN resultN
#     ELSE result
#     END;

In [ ]:
sql_query("select firstname, case when lastname='Fuller' then 'IT' when lastname='Peacock' then 'BS' else 'MG' end as status, lastname from employee")

# NULL functions

In [ ]:
# IFNULL() function lets you return an alternative value if an expression is NULL:

In [ ]:
sql_query("select firstname, lastname, reportsto from employee where reportsto is null")

In [ ]:
sql_query("select firstname, lastname, ifnull(reportsto,99) from employee")

# Stored procedures

In [ ]:
# NOTE: Sqlite does not support stored procedures

# SQL Comments

In [ ]:
sql_query("--This is a comment: \n /*multi-line \ncomments*/\n select firstname, lastname, ifnull(reportsto,99) from employee")

# Create database

In [ ]:
# connect to a database will create db if not exit
conn = sqlite3.connect('./Data/testDB.db')
conn.close()

# Drop database

In [ ]:
# Can just delete the sqlite database file

# Backup database

In [ ]:
# Copy and paste the database file

# Create table

In [ ]:
# SQLITE Datatypes

# NULL. The value is a NULL value.

# INTEGER. The value is a signed integer, stored in 1, 2, 3, 4, 6, or 8 bytes depending on the magnitude of the value.

# REAL. The value is a floating point value, stored as an 8-byte IEEE floating point number.

# TEXT. The value is a text string, stored using the database encoding (UTF-8, UTF-16BE or UTF-16LE).

# BLOB. The value is a blob of data, stored exactly as it was input.

In [ ]:
def sql_query_v2(cmd):
    conn = sqlite3.connect('./Data/testDB.db')
    c = conn.cursor()
    c.execute(cmd)
    data = c.fetchall()
    conn.commit()
    conn.close()
    return data

In [ ]:
conn = sqlite3.connect('./Data/testDB.db')
c = conn.cursor()
c.execute("create table person (personid int, firstname varchar(255), lastname varchar(255))")
conn.commit()
conn.close()

In [ ]:
sql_query_v2("select * from pragma_table_info('person')")

# Drop table

In [ ]:
def drop_table(table):
    sql_query_v2("drop table {}".format(table))
    
# sql_query_v2("drop table person")
# sql_query_v2("select * from pragma_table_info('person')")

# Alter table

In [ ]:
# NOTE: sqlite does not support modifying column

In [ ]:
# add column
sql_query_v2("alter table person add email varchar(255)")

In [ ]:
# drop column
sql_query_v2("alter table person drop email")

In [ ]:
sql_query_v2("select * from pragma_table_info('person')")

In [ ]:
sql_query_v2("alter table person rename to peps")

In [ ]:
# rename column
sql_query_v2("alter table person rename column email to address")

In [ ]:
sql_query_v2("select * from pragma_table_info('peps')")

# Constraints

In [ ]:
# NOT NULL Constraint − Ensures that a column cannot have NULL value.

# DEFAULT Constraint − Provides a default value for a column when none is specified.

# UNIQUE Constraint − Ensures that all values in a column are different.

# PRIMARY Key − Uniquely identifies each row/record in a database table.

# CHECK Constraint − Ensures that all values in a column satisfies certain conditions.

# Pragma_table_info columns - cid, name, type, not null, default value, primary key

In [ ]:
# not null
sql_query_v2("create table person (personid int primary key, firstname varchar(255) NOT NULL, lastname varchar(255) NOT NULL)")

In [ ]:
sql_query_v2("select * from pragma_table_info('person')")

In [ ]:
# default
sql_query_v2("create table person (personid int, firstname varchar(255) NOT NULL, lastname varchar(255) DEFAULT 'Banana')")

In [ ]:
drop_table('person')

In [ ]:
# unique
sql_query_v2("create table person (personid int, firstname varchar(255), lastname varchar(255), UNIQUE (firstname))")

In [ ]:
# primary key
sql_query_v2("create table person (personid int primary key, firstname varchar(255), lastname varchar(255))")

In [ ]:
# check
sql_query_v2("create table person (personid int primary key, firstname varchar(255), lastname varchar(255), age int, check (age>18))")